Repository: japsu/django-nexmo
Catalog: nexmo/locale/*/LC_MESSAGES/django.po
Languages: fi

source: Finnish
fi: Suomi

source: Message arrived to handset.
fi: Viesti saapunut vastaanottajalle.

source: Message timed out after we waited 48h to receive status from mobile operator.
fi: Viestiä ei saatu toimitettua vastaanottajalle 48 tunnin kuluessa.

source: Message failed to be delivered.
fi: Viestin välitys perille epäonnistui.

source: Message has been accepted by the mobile operator.
fi: Operaattori hyväksyi viestin.

source: Message is being delivered.
fi: Viestiä välitetään.

source: Un documented status from the mobile operator.
fi: Dokumentoimaton virhe operaattorilta.

source: Unknown status
fi: Tuntematon tila

source: Delivered
fi: Välitetty

source: Unknown error
fi: Tuntematon virhe

source: Absent Subscriber - Temporary
fi: Vastaanottaja ei ole verkossa - Väliaikainen virhe

source: Absent Subscriber - Permenant
fi: Vastaanottaja ei ole verkossa - Pysyvä virhe

source: Call barred by user
fi: Vastaanottaja hylkäsi puhelun.

source: Portability Error
fi: Siirtovirhe

source: Anti-Spam Rejection
fi: Roskapostiesto

source: Handset Busy
fi: Vastaanottaja varattu

source: Network Error
fi: Verkkovirhe

source: Illegal Number
fi: Laiton numero

source: Invalid Message
fi: Virheellinen viesti

source: Unroutable
fi: Reititysvirhe

source: General Error
fi: Geneerinen virhe

source: Queued
fi: Jonossa

source: In Transit
fi: Toimituksessa

source: Error in delivery
fi: Virhe viestin välityksessä

source: Success
fi: Onnistui

source: Throttled
fi: Kuristettu

source: Missing params
fi: Parametreja puuttuu

source: Invalid params
fi: Virheellinen parametri

source: Invalid credentials
fi: Virheellinen käyttäjätunnustiedot

source: Internal error
fi: Sisäinen virhe

source: Invalid message
fi: Virheellinen viesti

source: Number barred
fi: Numero vanhentunut

source: Partner account barred
fi: Käyttäjätunnustiedot vanhentuneet

source: Partner quota exceeded
fi: Kiintiö ylitetty

source: Account not enabled for REST
fi: Käyttäjätunnuksella ei oikeuksia RESTiin.

source: Message too long
fi: Viesti liian pitkä

source: Communication Failed
fi: Kommunikaatio epäonnistui

source: Invalid Signature
fi: Virheellinen allekirjoitus

source: Invalid sender address
fi: Virheellinen lähettäjän osoite

source: Invalid TTL
fi: Virheellinen TTL

source: Facility not allowed
fi: Viestityyppiä ei sallittu

source: Invalid Message class
fi: Virheellinen viestityyppi

source: Nexmos identification
fi: Nexmon yksilöintitieto

source: Nexmo identifies different messages with this identification.
fi: Nexmo erittelee eri viestit tällä yksilöintitiedolla.

source: Sender
fi: Lähettäjä

source: Message receive time (nexmo)
fi: Viestin vastaanottohetki (nexmo)

source: Message receive time (local)
fi: Viestin vastaanottohetki (paikallinen)

source: Text message
fi: Tekstiviesti

source: Multi-part message identification
fi: Moniosaisen viestin yksilöintitieto

source: Nexmo identifies different message parts with this identification
fi: Nexmo erittelee viestin eri osat tällä yksilöintitiedolla.

source: Multi-part message sequence number
fi: Moniosaisen viestin järjestysnumero

source: Multi-part message total amount of pieces.
fi: Moniosaisen viestin palojen kokonaismäärä.

source: Recipient
fi: Vastaanottaja

source: Send time
fi: Viestin lähetyshetki

source: Send status
fi: Lähetysstatus

source: Delivery status
fi: Välitysstatus

source: Message status
fi: Viestin status

source: Amount of physical messages
fi: Fyysisten viestien määrä

source: External reference
fi: Ulkoinen viittaus

source: Refers to event/program/poll/whatever.
fi: Viittaus tapahtumaan/ohjelmaan/äänestykseen/whatnot.

source: Error status
fi: Viestin virhestatus

source: Timestamp of status
fi: Statuksen saantihetki

source: Inbound Message Fragment
fi: Vastaanotettu viestipala

source: Inbound Message Fragments
fi: Vastaanotetut viestipalat

source: Inbound Message
fi: Vastaanotettu viesti

source: Inbound Messages
fi: Vastaanotetut viestit

source: Outbound Message
fi: Lähtevä viesti

source: Outbound Messages
fi: Lähtevät viestit
